/*****************************************************************
 * Copyright(c) 2012, 武汉中原电子集团 应用电子研发中心
 * All rights reserved.
 * *
 * 文件名称:
 *
 * 摘要:
 *
 * 作者:PengPeng <yougukepp@gmail.com>
 *
 * 完成日期:
 *****************************************************************/
/*--------------------------- 预处理区 --------------------------*/
#ifndef __SICP_H__
#define __SICP_H__

/***************************** 头文件 ****************************/
#include "config.h"
#include "typedef.h"


/***************************** 宏定义 ****************************/


/**************************** 类型定义 ***************************/





/*-------------------------- 接口声明区 -------------------------*/

/**************************** 全局变量 ***************************/


/**************************** 接口函数 ***************************/
/*
 * 功能:                求n的阶乘
 *
 * 参数 n:              阶乘输入值
 *
 * 返回值:              n的阶乘
 *
 */
unsigned long long factorial(int n);

/*
 * 功能:                求第n的斐波拉西(fibnacci)级数
 *
 * 参数 n:              欲求的斐波拉西级数索引
 *
 * 返回值:              第n的斐波拉西(fibnacci)级数
 *
 */
unsigned long long fibonacci(int n);

#endif


