/*****************************************************************
 * Copyright(c) 2012, 武汉中原电子集团 应用电子研发中心
 * All rights reserved.
 * *
 * 文件名称:
 *
 * 摘要:
 *
 * 作者:PengPeng <yougukepp@gmail.com>
 *
 * 完成日期:
 *****************************************************************/
/*--------------------------- 预处理区 --------------------------*/

/***************************** 头文件 ****************************/
#include <myself.h>

/*----------------------------- 声明区 --------------------------*/

/**************************** 变量声明区 *************************/


/**************************** 函数声明区 *************************/


/*************************** 变量实现区 **************************/


/*************************** 函数实现区 **************************/
/*
 * 设有一半径为r的圆及其外切四边形,向该正方形随机地投掷n个点.
 * 若落入圆内的点数为k,由于所投入的点在正方形上均匀分布,
 * 故所投入的点落入圆内的概率为(PI*(r*r))/((2r)*(2r)) = PI / 4.
 * 当n足够大时,k与n之比就逼近这一概率,即PI约等于(4*k)/n. 
 * */
double randomPi(int n)
{
    if(n <= 0)
    {
        n = 10000;
    }

    int k = 0 ;
    for (int i = 0; i < n; ++ i) {
        double w = getRangeRand(0.0, 1.0);
        double h = getRangeRand(0.0, 1.0);
        if ((w * w + h * h) <= 1.0) {
            ++ k ;
        }
    }

    return (4.0 * k) / n ;
}

