/*****************************************************************
 * Copyright(c) 2012, 武汉中原电子集团 应用电子研发中心
 * All rights reserved.
 * *
 * 文件名称:
 *
 * 摘要:
 *
 * 作者:
 *
 * 完成日期:
 *****************************************************************/
/*--------------------------- 预处理区 --------------------------*/
/* 若使用__EGL__会和EGL/egl.h重复!!!  */
#ifndef         __GIS_EGL_H__
#define         __GIS_EGL_H__
/***************************** 头文件 ****************************/
#include	<assert.h>
#include	<stdio.h>
#include        <fcntl.h>
#include        <EGL/egl.h>
#include        <GLES2/gl2.h>

/***************************** 宏定义 ****************************/

/*-------------------------- 接口声明区 -------------------------*/

/**************************** 全局变量 ***************************/

/*--------------------------- 接口函数 --------------------------*/
extern EGLint EsInit(void);
extern GLvoid EsDeInit(void);
extern GLint getWidth(void);
extern GLint getHeight(void);
extern GLvoid ESSwapBuffers(void);

#endif
