/*****************************************************************
 * Copyright(c) 2012, 武汉中原电子集团 应用电子研发中心
 * All rights reserved.
 * *
 * 文件名称:
 *
 * 摘要:
 *
 * 作者:PengPeng <yougukepp@gmail.com>
 *
 * 完成日期:
 *****************************************************************/
/*--------------------------- 预处理区 --------------------------*/
#ifndef __GIS_COLOR_H__
#define __GIS_COLOR_H__

/***************************** 头文件 ****************************/


/***************************** 宏定义 ****************************/


/**************************** 类型定义 ***************************/
class GisColor
{
public:
    GisColor(void);
    GisColor(float r, float g, float b);
    float GetR(void);
    float GetG(void);
    float GetB(void);

protected:

private:
    float m_r;
    float m_g;
    float m_b;
};

/*-------------------------- 接口声明区 -------------------------*/

/**************************** 全局变量 ***************************/


/**************************** 接口函数 ***************************/

#endif

