/*****************************************************************
 * Copyright(c) 2012, 武汉中原电子集团 应用电子研发中心
 * All rights reserved.
 * *
 * 文件名称:
 *
 * 摘要:
 *
 * 作者:PengPeng <yougukepp@gmail.com>
 *
 * 完成日期:
 *****************************************************************/
/*--------------------------- 预处理区 --------------------------*/

/***************************** 头文件 ****************************/
#include "sicp.h"
#include <stdio.h>

/*----------------------------- 声明区 --------------------------*/

/**************************** 变量声明区 *************************/


/**************************** 函数声明区 *************************/


/*************************** 变量实现区 **************************/


/*************************** 函数实现区 **************************/
unsigned long long fibonacci(int n)
{
    assert(n >= 0);
    int i = 0;
    unsigned long long a = 0;                          // 第n-1个 斐波拉西级数
    unsigned long long b = 0;                          // 第n-2个 斐波拉西级数
    unsigned long long temp = 0;

    if(n<2)
    {
        return n;
    }

    a = 1;
    b = 0;
    for(i=0;i<n;i++)
    {
        temp = a;
        a = a+b;
        b = temp;
    }

    return a;
}


